coocox/Mplib/Toshaba/TMPM36x/TMPM361/cmsis_lib/lib/include/tmpm361_cec.h
    typedef enum {
        CEC_TX_DATA_BIT_CYCLE_0 = 0U,    /*!< RV (Reference value: 2.4ms approx.) */
        CEC_TX_DATA_BIT_CYCLE_1 = 1U,    /*!< RV-1cycle */
        CEC_TX_DATA_BIT_CYCLE_2 = 2U,    /*!< RV-2cycles */
        CEC_TX_DATA_BIT_CYCLE_3 = 3U,    /*!< RV-3cycles */
        CEC_TX_DATA_BIT_CYCLE_4 = 4U,    /*!< RV-4cycles */
        CEC_TX_DATA_BIT_CYCLE_5 = 5U,    /*!< RV-5cycles */
        CEC_TX_DATA_BIT_CYCLE_6 = 6U,    /*!< RV-6cycles */
        CEC_TX_DATA_BIT_CYCLE_7 = 7U,    /*!< RV-7cycles */
        CEC_TX_DATA_BIT_CYCLE_8 = 8U,    /*!< RV-8cycles */
        CEC_TX_DATA_BIT_CYCLE_9 = 9U,    /*!< RV-9cycles */
        CEC_TX_DATA_BIT_CYCLE_10 = 10U,  /*!< RV-10cycles */
        CEC_TX_DATA_BIT_CYCLE_11 = 11U,  /*!< RV-11cycles */
        CEC_TX_DATA_BIT_CYCLE_12 = 12U,  /*!< RV-12cycles */
        CEC_TX_DATA_BIT_CYCLE_13 = 13U,  /*!< RV-13cycles */
        CEC_TX_DATA_BIT_CYCLE_14 = 14U,  /*!< RV-14cycles */
        CEC_TX_DATA_BIT_CYCLE_15 = 15U   /*!< RV-15cycles */
    } CEC_TxDataBitCycle;
#define IS_CEC_TX_DATA_BIT_CYCLE(param)    (((param) == CEC_TX_DATA_BIT_CYCLE_0) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_1) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_2) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_3) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_4) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_5) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_6) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_7) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_8) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_9) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_10) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_11) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_12) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_13) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_14) || \
                                            ((param) == CEC_TX_DATA_BIT_CYCLE_15 ))

    typedef enum {
        CEC_TX_DATA_BIT_RISING_TIME_0 = 0U,      /*!< RV (logical "1": 0.6 ms approx.,logical "0": 1.5 ms approx) */
        CEC_TX_DATA_BIT_RISING_TIME_1 = 1U,      /*!< RV-1cycle */
        CEC_TX_DATA_BIT_RISING_TIME_2 = 2U,      /*!< RV-2cycles */
        CEC_TX_DATA_BIT_RISING_TIME_3 = 3U,      /*!< RV-3cycles */
        CEC_TX_DATA_BIT_RISING_TIME_4 = 4U,      /*!< RV-4cycles */
        CEC_TX_DATA_BIT_RISING_TIME_5 = 5U,      /*!< RV-5cycles */
        CEC_TX_DATA_BIT_RISING_TIME_6 = 6U,      /*!< RV-6cycles */
        CEC_TX_DATA_BIT_RISING_TIME_7 = 7U       /*!< RV-7cycles */
    } CEC_TxDataBitRisingTime;
#define IS_CEC_TX_DATA_BIT_RISING_TIME(param)    (((param) == CEC_TX_DATA_BIT_RISING_TIME_0) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_1) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_2) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_3) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_4) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_5) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_6) || \
                                                  ((param) == CEC_TX_DATA_BIT_RISING_TIME_7 ))

    typedef enum {
        CEC_TX_START_BIT_CYCLE_0 = 0U,   /*!< RV (4.5ms approx.) */
        CEC_TX_START_BIT_CYCLE_1 = 1U,   /*!< RV-1cycle */
        CEC_TX_START_BIT_CYCLE_2 = 2U,   /*!< RV-2cycles */
        CEC_TX_START_BIT_CYCLE_3 = 3U,   /*!< RV-3cycles */
        CEC_TX_START_BIT_CYCLE_4 = 4U,   /*!< RV-4cycles */
        CEC_TX_START_BIT_CYCLE_5 = 5U,   /*!< RV-5cycles */
        CEC_TX_START_BIT_CYCLE_6 = 6U,   /*!< RV-6cycles */
        CEC_TX_START_BIT_CYCLE_7 = 7U    /*!< RV-7cycles */
    } CEC_TxStartBitCycle;
#define IS_CEC_TX_START_BIT_CYCLE(param)    (((param) == CEC_TX_START_BIT_CYCLE_0) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_1) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_2) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_3) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_4) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_5) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_6) || \
                                             ((param) == CEC_TX_START_BIT_CYCLE_7 ))

    typedef enum {
        CEC_TX_START_BIT_RISING_TIME_0 = 0U,     /*!< RV (3.7ms approx.) */
        CEC_TX_START_BIT_RISING_TIME_1 = 1U,     /*!< RV-1cycle */
        CEC_TX_START_BIT_RISING_TIME_2 = 2U,     /*!< RV-2cycles */
        CEC_TX_START_BIT_RISING_TIME_3 = 3U,     /*!< RV-3cycles */
        CEC_TX_START_BIT_RISING_TIME_4 = 4U,     /*!< RV-4cycles */
        CEC_TX_START_BIT_RISING_TIME_5 = 5U,     /*!< RV-5cycles */
        CEC_TX_START_BIT_RISING_TIME_6 = 6U,     /*!< RV-6cycles */
        CEC_TX_START_BIT_RISING_TIME_7 = 7U      /*!< RV-7cycles */
    } CEC_TxStartBitRisingTime;
#define IS_CEC_TX_START_BIT_RISING_TIME(param)    (((param) == CEC_TX_START_BIT_RISING_TIME_0) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_1) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_2) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_3) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_4) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_5) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_6) || \
                                                   ((param) == CEC_TX_START_BIT_RISING_TIME_7 ))


